---
kind: method
id: M:Autodesk.Revit.DB.ReferencePoint.GetInterpolatingCurves
source: html/1b1517e8-b244-e249-9f01-e6137b40c886.htm
---
# Autodesk.Revit.DB.ReferencePoint.GetInterpolatingCurves Method

The set of CurveByPoints elements that interpolate
a ReferencePoint.

## Syntax (C#)
```csharp
public CurveByPointsArray GetInterpolatingCurves()
```

## Remarks
A CurveByPoints is in the GetInterpolatingCurves () () ()
array if and only if the ReferencePoint is in the Points array of
 CurveByPoints .